{"id":432,"date":"2022-05-23T09:15:12","date_gmt":"2022-05-23T09:15:12","guid":{"rendered":"http:\/\/www.greenfuture.space\/?p=432"},"modified":"2022-05-26T18:11:18","modified_gmt":"2022-05-26T18:11:18","slug":"youcef-zaineclimate-activist","status":"publish","type":"post","link":"http:\/\/www.greenfuture.space\/climate-change\/youcef-zaineclimate-activist\/","title":{"rendered":"&#8220;Youcef Ziane&#8221;Climate Activist"},"content":{"rendered":"<p><span style=\"font-weight: 400\">Youcef Ziane was one of the French participants in the Green Future project held in Ajloun, Jordan, which is one of the Erasmus+ projects, he has a bachelor&#8217;s degree in Psychology, and right now he is going to volunteer in Jordan for 6 months and this is his third voluntary project. In this project, he is working on solutions to fight against climate change. <\/span><\/p>\n<p><span style=\"font-weight: 400\">We had an interview with Youcef and asked him about his thoughts and opinion on environmental issues <\/span><\/p>\n<p><strong>-What are the daily habits &amp; practices you follow to protect the environment?<\/strong><\/p>\n<p><b>Youcef<\/b><span style=\"font-weight: 400\">: Most of the time, I’m focusing on my plastic consumption, so trying to avoid items that use a lot of plastic, and use zero waste shop when I can. I  avoid the use of plastic bags by using tote bags. <\/span><span style=\"font-weight: 400\">I’m also careful with my water consumption, such as not letting the water open when I’m washing the dishes when I’m taking a shower, or simply when I’m washing my hands. <\/span><span style=\"font-weight: 400\">Of course, I’m doing the same with my electricity consumption, use it only when it’s necessary. <\/span><span style=\"font-weight: 400\">I also try to walk when going from one point to the another, as much as possible or using public transport, although it can be challenging in some areas. <\/span><span style=\"font-weight: 400\">Finally, I’m trying to learn a lot about this subject, reading some articles, and books, watching some videos and listening to podcasts. I believe that « forewarned is forearmed .»<\/span><\/p>\n<p><strong>&#8211; In your opinion, what are the adequate approaches in order to reduce global warming which is making climate change?<\/strong><\/p>\n<p><b>Youcef:<\/b><span style=\"font-weight: 400\"> I think that the best approach is to start with making people understand that individualism is our enemy. This is a collective problem and individual answers cannot answer it. We need to work tighter on the solution and try the right solution for each different situation. It’s also one of the main challenges, that individualism is so settled down and when you are facing something that scares you, you will start to be even more individualist to protect yourself and your loved ones. <\/span><span style=\"font-weight: 400\">I think the main challenge is to make the industrial sector understand that push them quickly change. The notion of time is crucial, we don’t have 20, 30, or even 10 years in front of us. If we do not improve our way of consuming\/living in the next 3 to 5 years, the situation will be dramatic for all of us. <\/span><span style=\"font-weight: 400\">Don’t misunderstand me, I don’t want to scare people but I  want people to realize that it’s a crucial emergency, and no matter how much rich you are, you will end up facing the consequences. So, the way to resolve it, it&#8217;s not to start to panic and buy as much toilet paper as we can, but to focus on solutions that we can do, each one on his\/her own scale.<\/span><\/p>\n<p><strong>-what would you recommend for people so they can contribute to reducing pollution and protecting the environment?<\/strong><\/p>\n<p><b>Youcef<\/b><span style=\"font-weight: 400\">: There are a lot of solutions that each one can do. But what I would like to recommend today to people is to be curious and to start to learn about what is climate change, not only putting on the TV, and go to do something else at the same time. Really, take the time to understand it you will be able to explain it to colleagues, friends, and family without being seen as a nerd or a hysterical person. There are a lot of resources online, almost every newspaper has articles about it, and you have a lot of podcasts and books that can be useful resources in your learning process.  <\/span><span style=\"font-weight: 400\">For example, NASA proposes a climate change website with all you need to know about climate change, from the evidence of it to the solution that we can do. <\/span><span style=\"font-weight: 400\">You also have the WWF websites (WorldWide Fund For Nature), a wealth of information to improve your knowledge about. <\/span><span style=\"font-weight: 400\">You also have the Cambridge University podcast how did some episodes about the climate change situation. The future of life institute is also doing a great job on that. <\/span><\/p>\n<p><span style=\"font-weight: 400\">You can read the book:<\/span><\/p>\n<p><span style=\"font-weight: 400\">&#8211; &#8220;All We Can Save: Truth, Courage, and Solutions for the Climate Crisis&#8221; edited by Ayana Johnson and Katharine K. Wilkinson<\/span><\/p>\n<p><span style=\"font-weight: 400\">&#8211; &#8220;Biodiversity and Climate Change: Transforming the Biosphere&#8221; edited by Thomas E. Lovejoy and Lee Hannah<\/span><\/p>\n<p><span style=\"font-weight: 400\">Two great books to start if you want to learn more about this topic. <\/span><span style=\"font-weight: 400\">I’ve tried to give you some resources to start or continue your learning process on this subject. Don’t hesitate to share more resources with us in the comment below. <\/span><\/p>\n<p><b>Youcef<\/b><span style=\"font-weight: 400\">: Thank you for taking the time to read. Alone we go faster but together we go further.<\/span><\/p>\n<p><span style=\"font-weight: 400\">Thank you so much Youcef for these illuminated ideas and valuable resources  <\/span><\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Youcef Ziane was one of the French participants in the Green Future project held in Ajloun, Jordan, which is one of the Erasmus+ projects, he has a bachelor&#8217;s degree in Psychology, and right now he is going to volunteer in Jordan for 6 months and this is his third voluntary project. In this project, he [&hellip;]<\/p>\n","protected":false},"author":9,"featured_media":440,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[3],"tags":[],"_links":{"self":[{"href":"http:\/\/www.greenfuture.space\/wp-json\/wp\/v2\/posts\/432"}],"collection":[{"href":"http:\/\/www.greenfuture.space\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/www.greenfuture.space\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/www.greenfuture.space\/wp-json\/wp\/v2\/users\/9"}],"replies":[{"embeddable":true,"href":"http:\/\/www.greenfuture.space\/wp-json\/wp\/v2\/comments?post=432"}],"version-history":[{"count":6,"href":"http:\/\/www.greenfuture.space\/wp-json\/wp\/v2\/posts\/432\/revisions"}],"predecessor-version":[{"id":438,"href":"http:\/\/www.greenfuture.space\/wp-json\/wp\/v2\/posts\/432\/revisions\/438"}],"wp:featuredmedia":[{"embeddable":true,"href":"http:\/\/www.greenfuture.space\/wp-json\/wp\/v2\/media\/440"}],"wp:attachment":[{"href":"http:\/\/www.greenfuture.space\/wp-json\/wp\/v2\/media?parent=432"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/www.greenfuture.space\/wp-json\/wp\/v2\/categories?post=432"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/www.greenfuture.space\/wp-json\/wp\/v2\/tags?post=432"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}